#### Working with SQLITE & Python

Let us connect to our sqlite database

##### 1. Import required Libraries

In [4]:
import pandas as pd
import sqlite3

##### 2. Connect to existing SQLITE database

In [6]:
# The term 'connection' is just a variable name.
connection = sqlite3.connect('C:\\Users\\wycli\\Documents\\uadsl\\SQl\\hr')

##### 3. Create a cursor object

In [8]:
cursor = connection.cursor()

##### 4. View all existing table in the database

In [10]:
# Setup the sql statements
sql = ''' 
     SELECT name AS table_name
     FROM sqlite_master
     WHERE TYPE = 'table';
     '''
# Execute the sql statements
cursor.execute(sql)

In [11]:
##### Print records from sql execution.
rows = cursor.fetchall()
for row in rows:
    print(row[0].title())

Countries
Regions
Locations
Departments
Jobs
Employees
Department
Job_History
Prod_Mast
Prod_Backup
Orders
Tb1
Esercicio1
Users
Tags
S
R
Emor
Min_Salary
Employee_Data
Student
Employee_Income
Details

In [26]:
#fetch all records from countries
country_sql = ''' 
              SELECT * 
              FROM COUNTRIES
              LIMIT 10;
              '''
cursor.execute(country_sql)
country_records = cursor.fetchall()
for row in country_records:
    print(row)

('country_id', 'country_name', 'region_id')
('AR', 'Argentina', 2)
('AU', 'Australia', 3)
('BE', 'Belgium', 1)
('BR', 'Brazil', 2)
('CA', 'Canada', 2)
('CH', 'Switzerland', 1)
('CN', 'China', 3)
('DE', 'Germany', 1)
('DK', 'Denmark', 1)

In [13]:
# cursor.execute('SELECT * FROM COUNTRIES;')
# rows = cursor.fetchmany(10)
# for row in rows:
#     print(row[1])

In [14]:
country_df = pd.DataFrame(country_records)
country_df.head()

            0             1          2
0  country_id  country_name  region_id
1          AR     Argentina          2
2          AU     Australia          3
3          BE       Belgium          1
4          BR        Brazil          2

In [15]:
#convert the output rows into a neat dataframe
country_df = pd.DataFrame(country_records[1:] , columns = country_records[0])
country_df.head()

  country_id country_name  region_id
0         AR    Argentina          2
1         AU    Australia          3
2         BE      Belgium          1
3         BR       Brazil          2
4         CA       Canada          2

#### Method 2

##### Using pandas read sql method

In [34]:
df = pd.read_sql(country_sql,connection)
df.head()

   country_id  country_name  region_id
0  country_id  country_name  region_id
1          AR     Argentina          2
2          AU     Australia          3
3          BE       Belgium          1
4          BR        Brazil          2

In [44]:
df.rename(columns={'country_id': 'Country ID', 'country_name': 'Country Name', 'region_id': 'Region ID'}, inplace=True)
df.head()

   Country ID  Country Name  Region ID
0  country_id  country_name  region_id
1          AR     Argentina          2
2          AU     Australia          3
3          BE       Belgium          1
4          BR        Brazil          2